[
  {
    "citation": "2006 WL 3801910",
    "volume": "2006",
    "page": "3801910",
    "case_name": null,
    "page_num": 3,
    "paragraph": "Department of Energy, 2006 WL 3801910 (D. Wyo. 2006), the court emphasized the importance",
    "context": "...that  evidence with a high potential for prejudice should be excluded to ensure a fair trial.    Additionally, Wyoming case law reinforces these principles. In Wyoming v. U.S.  Department of Energy, 2006 WL 3801910 (D. Wyo. 2006), the court emphasized the importance  of preventing jury confusion and undue prejudice. In Holland v. Keller, 2018 WL 2446162 (D.  Wyo. 2018), the court ruled that inflammatory evidenc..."
  },
  {
    "citation": "2018 WL 2446162",
    "volume": "2018",
    "page": "2446162",
    "case_name": "Additionally, Wyoming case law reinforces these principles. In Wyoming v. U.S. Department of Energy,",
    "page_num": 3,
    "paragraph": "of preventing jury confusion and undue prejudice. In Holland v. Keller, 2018 WL 2446162 (D.",
    "context": "...hese principles. In Wyoming v. U.S.  Department of Energy, 2006 WL 3801910 (D. Wyo. 2006), the court emphasized the importance  of preventing jury confusion and undue prejudice. In Holland v. Keller, 2018 WL 2446162 (D.  Wyo. 2018), the court ruled that inflammatory evidence should be excluded, reinforcing the need  to maintain a fair and impartial trial environment. Further, United States v. Hargrove, 2019 WL..."
  },
  {
    "citation": "2019 WL \n2516279",
    "volume": "2019",
    "page": "2516279",
    "case_name": "In Holland v. Keller,",
    "page_num": 3,
    "paragraph": "to maintain a fair and impartial trial environment. Further, United States v. Hargrove, 2019 WL  2516279 (D. Wyo. 2019), reiterated that evidence likely to cause unfair prejudice should be",
    "context": "...L 2446162 (D.  Wyo. 2018), the court ruled that inflammatory evidence should be excluded, reinforcing the need  to maintain a fair and impartial trial environment. Further, United States v. Hargrove, 2019 WL  2516279 (D. Wyo. 2019), reiterated that evidence likely to cause unfair prejudice should be  excluded if it outweighs its probative value. Similarly, Meyer v. City of Cheyenne, 2017 WL  3461055 (D. Wyo. 2017..."
  },
  {
    "citation": "2017 WL \n3461055",
    "volume": "2017",
    "page": "3461055",
    "case_name": "Further, United States v. Hargrove,",
    "page_num": 3,
    "paragraph": "excluded if it outweighs its probative value. Similarly, Meyer v. City of Cheyenne, 2017 WL  3461055 (D. Wyo. 2017), highlighted that the use of terms that could unduly influence a jury’s",
    "context": "...v. Hargrove, 2019 WL  2516279 (D. Wyo. 2019), reiterated that evidence likely to cause unfair prejudice should be  excluded if it outweighs its probative value. Similarly, Meyer v. City of Cheyenne, 2017 WL  3461055 (D. Wyo. 2017), highlighted that the use of terms that could unduly influence a jury’s  perception of a party should be excluded to preserve the integrity of the trial process. Evidence is  unfairly..."
  },
  {
    "citation": "2017 WL 3461055",
    "volume": "2017",
    "page": "3461055",
    "case_name": null,
    "page_num": 4,
    "paragraph": "of Cheyenne, 2017 WL 3461055 (D. Wyo. 2017). Allowing such evidence would run afoul of the",
    "context": "..., warranting its exclusion. The use of terms that could unduly influence a jury’s  perception of a party should be excluded to preserve the integrity of the trial process. Meyer v. City  of Cheyenne, 2017 WL 3461055 (D. Wyo. 2017). Allowing such evidence would run afoul of the  safeguards set forth in Federal Rules of Evidence 401, 402, and 403. As such, any reference to  “smoking shed” by Defendants, their coun..."
  },
  {
    "citation": "2010 WL 4683851",
    "volume": "2010",
    "page": "4683851",
    "case_name": null,
    "page_num": 4,
    "paragraph": "Evidence intend to protect against. In Benson v. State of Wyoming, 2010 WL 4683851 (D. Wyo.",
    "context": "...s hypothetical theory is the type of  impermissible stacking of inferences and uncorroborated speculation that the Federal Rules of  Evidence intend to protect against. In Benson v. State of Wyoming, 2010 WL 4683851 (D. Wyo.  2010), the court emphasized that speculative testimony without concrete evidence is inadmissible,  Case 2:23-cv-00118-KHR     Document 141     Filed 01/22/25     Page 4 of 9..."
  },
  {
    "citation": "2011 WL 2160468",
    "volume": "2011",
    "page": "2160468",
    "case_name": null,
    "page_num": 5,
    "paragraph": "In Smith v. United States, 2011 WL 2160468 (D. Wyo. 2011), the court ruled that evidence of a",
    "context": "...Plaintiff. Federal courts have consistently held that testimony regarding  alcohol use is irrelevant where there is no evidence to establish a causal link to the incident.  In Smith v. United States, 2011 WL 2160468 (D. Wyo. 2011), the court ruled that evidence of a  party's alcohol consumption was inadmissible because it lacked a direct connection to the events  at issue. Allowing testimony of any alcohol consu..."
  },
  {
    "citation": "2019 WL 2516279",
    "volume": "2019",
    "page": "2516279",
    "case_name": null,
    "page_num": 7,
    "paragraph": "States v. Hargrove, 2019 WL 2516279 (D. Wyo. 2019), the court noted that duplicative expert",
    "context": "...lowing multiple experts to testify on the same matter can lead to the risk of juror  confusion and the potential for undue emphasis on certain aspects of the testimony. In United  States v. Hargrove, 2019 WL 2516279 (D. Wyo. 2019), the court noted that duplicative expert  testimony can be excluded under FRE 403 as it may confuse the issues and mislead the jury. The  court found that presenting multiple opinions..."
  },
  {
    "citation": "2016 \nWL 165971",
    "volume": "2016",
    "page": "165971",
    "case_name": null,
    "page_num": 8,
    "paragraph": "their product is safe and cannot cause injury or malfunction. In Woods v. BNSF Railway Co., 2016  WL 165971 (D. Wyo. 2016), the court held that allowing a defendant to present evidence of their",
    "context": "...the  subject hoverboard is listed under UL 2272, and that such listing is essentially a certification that  their product is safe and cannot cause injury or malfunction. In Woods v. BNSF Railway Co., 2016  WL 165971 (D. Wyo. 2016), the court held that allowing a defendant to present evidence of their  product's safety or lack of prior incidents could skew the jury's perception and distract from the  relevant iss..."
  },
  {
    "citation": "2018 WL 3037217",
    "volume": "2018",
    "page": "3037217",
    "case_name": "BNSF Railway Co.,",
    "page_num": 8,
    "paragraph": "relevant issues at hand. Similarly, in Fitzgerald v. City of New York, 2018 WL 3037217 (S.D.N.Y.",
    "context": "...o present evidence of their  product's safety or lack of prior incidents could skew the jury's perception and distract from the  relevant issues at hand. Similarly, in Fitzgerald v. City of New York, 2018 WL 3037217 (S.D.N.Y.  2018), the court ruled that evidence regarding a defendant's claims of safety and lack of prior  injuries could mislead the jury, resulting in unfair prejudice against the plaintiff. As su..."
  }
]